socialNetwork/results/scaling-off-sweep-bench1.5-may19/benchmark1.5b-noscale-sweep-05-19-26_010234/istio/500.txt
Running 2m test @ http://155.98.37.84:80
  16 threads and 128 connections

  Thread calibration: mean lat.: 865.472ms, rate sampling interval: 4636ms
  Thread calibration: mean lat.: 972.404ms, rate sampling interval: 4493ms
  Thread calibration: mean lat.: 848.617ms, rate sampling interval: 4151ms
  Thread calibration: mean lat.: 528.208ms, rate sampling interval: 2269ms
  Thread calibration: mean lat.: 910.039ms, rate sampling interval: 3373ms
  Thread calibration: mean lat.: 900.701ms, rate sampling interval: 3481ms
  Thread calibration: mean lat.: 914.056ms, rate sampling interval: 3893ms
  Thread calibration: mean lat.: 693.151ms, rate sampling interval: 2981ms
  Thread calibration: mean lat.: 906.520ms, rate sampling interval: 4153ms
  Thread calibration: mean lat.: 712.512ms, rate sampling interval: 2838ms
  Thread calibration: mean lat.: 871.288ms, rate sampling interval: 4210ms
  Thread calibration: mean lat.: 779.192ms, rate sampling interval: 3575ms
  Thread calibration: mean lat.: 988.433ms, rate sampling interval: 4349ms
  Thread calibration: mean lat.: 597.940ms, rate sampling interval: 2455ms
  Thread calibration: mean lat.: 1027.651ms, rate sampling interval: 4542ms
  Thread calibration: mean lat.: 895.790ms, rate sampling interval: 4239ms

-----------------------------------------------------------------------
Test Results @ http://155.98.37.84:80 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    10.93s     6.07s   25.38s    63.65%
    Req/Sec    26.09      3.53    34.00     83.13%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.72s 
 75.000%   15.17s 
 90.000%   19.14s 
 99.000%   25.38s 
 99.900%   30.64s 
 99.990%   33.88s 
 99.999%   34.34s 
100.000%   34.34s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     122.495     0.000000            1         1.00
    2990.079     0.100000         4686         1.11
    4964.351     0.200000         9376         1.25
    6975.487     0.300000        14066         1.43
    8806.399     0.400000        18767         1.67
   10715.135     0.500000        23442         2.00
   11608.063     0.550000        25785         2.22
   12500.991     0.600000        28129         2.50
   13385.727     0.650000        30474         2.86
   14311.423     0.700000        32811         3.33
   15171.583     0.750000        35162         4.00
   15605.759     0.775000        36348         4.44
   16121.855     0.800000        37499         5.00
   16842.751     0.825000        38674         5.71
   17612.799     0.850000        39863         6.67
   18333.695     0.875000        41020         8.00
   18726.911     0.887500        41604         8.89
   19136.511     0.900000        42179        10.00
   19611.647     0.912500        42762        11.43
   20185.087     0.925000        43351        13.33
   20873.215     0.937500        43939        16.00
   21200.895     0.943750        44229        17.78
   21610.495     0.950000        44522        20.00
   21987.327     0.956250        44822        22.86
   22347.775     0.962500        45111        26.67
   22740.991     0.968750        45397        32.00
   22986.751     0.971875        45548        35.56
   23199.743     0.975000        45692        40.00
   23478.271     0.978125        45839        45.71
   23822.335     0.981250        45986        53.33
   24248.319     0.984375        46132        64.00
   24543.231     0.985938        46204        71.11
   24854.527     0.987500        46278        80.00
   25182.207     0.989062        46350        91.43
   25526.271     0.990625        46421       106.67
   25903.103     0.992188        46496       128.00
   26181.631     0.992969        46533       142.22
   26460.159     0.993750        46568       160.00
   26771.455     0.994531        46606       182.86
   26984.447     0.995313        46641       213.33
   27279.359     0.996094        46678       256.00
   27410.431     0.996484        46699       284.44
   27672.575     0.996875        46714       320.00
   28065.791     0.997266        46733       365.71
   28442.623     0.997656        46752       426.67
   29130.751     0.998047        46769       512.00
   29507.583     0.998242        46782       568.89
   29605.887     0.998437        46787       640.00
   29786.111     0.998633        46796       731.43
   30179.327     0.998828        46806       853.33
   30703.615     0.999023        46815      1024.00
   30851.071     0.999121        46819      1137.78
   31031.295     0.999219        46825      1280.00
   31145.983     0.999316        46828      1462.86
   31277.055     0.999414        46834      1706.67
   31817.727     0.999512        46838      2048.00
   32014.335     0.999561        46840      2275.56
   32145.407     0.999609        46843      2560.00
   32309.247     0.999658        46844      2925.71
   32931.839     0.999707        46847      3413.33
   33161.215     0.999756        46849      4096.00
   33423.359     0.999780        46850      4551.11
   33456.127     0.999805        46851      5120.00
   33619.967     0.999829        46852      5851.43
   33783.807     0.999854        46854      6826.67
   33882.111     0.999878        46856      8192.00
   33882.111     0.999890        46856      9102.22
   33882.111     0.999902        46856     10240.00
   33882.111     0.999915        46856     11702.86
   34078.719     0.999927        46857     13653.33
   34111.487     0.999939        46858     16384.00
   34111.487     0.999945        46858     18204.44
   34111.487     0.999951        46858     20480.00
   34111.487     0.999957        46858     23405.71
   34242.559     0.999963        46859     27306.67
   34242.559     0.999969        46859     32768.00
   34242.559     0.999973        46859     36408.89
   34242.559     0.999976        46859     40960.00
   34242.559     0.999979        46859     46811.43
   34340.863     0.999982        46860     54613.33
   34340.863     1.000000        46860          inf
#[Mean    =    10929.911, StdDeviation   =     6067.520]
#[Max     =    34308.096, Total count    =        46860]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  50926 requests in 2.00m, 627.43MB read
  Socket errors: connect 0, read 0, write 0, timeout 2
Requests/sec:    424.44  
Transfer/sec:      5.23MB